# FilePath Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ImageBackgroundSettings..::..FilePath Property
ImageBackgroundSettings Class See Also
---
File path of the image for the rendering background.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public string FilePath { get; set; }
```

Visual Basic
---
```text
Public Property FilePath As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ FilePath {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The file specified by path is not an image file. A valid image file should be in one of the following formats: bmp, jpg, jpeg, png, tif. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..FileArgumentNotFoundException | When setting this property: The file specified by path doesn't exist. |

# See Also
ImageBackgroundSettings Class
Autodesk.Revit.DB Namespace